Revit 2027 API
FillGrid.CalculateLengthPerArea Method
 Calculates length of the pattern per unit area.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CalculateLengthPerArea()
Public Function CalculateLengthPerArea As Double
public:
double CalculateLengthPerArea()
member CalculateLengthPerArea : unit -> float
Return Value
Double
 The length per area.
See Also
Reference
FillGrid Class
Autodesk.Revit.DB Namespace